results/fio/scmp/run1.log
write_throughput: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=64
...
fio-3.39-38-gf18c
Starting 16 processes
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
[...]

write_throughput: (groupid=0, jobs=16): err= 0: pid=2854344: Sun Apr 27 22:25:03 2025
  write: IOPS=514, BW=514MiB/s (539MB/s)(15.1GiB/30034msec); 0 zone resets
    clat (usec): min=3963, max=70348, avg=31039.37, stdev=2711.40
     lat (usec): min=4012, max=70396, avg=31083.56, stdev=2711.47
    clat percentiles (usec):
     |  1.00th=[23200],  5.00th=[31065], 10.00th=[31065], 20.00th=[31065],
     | 30.00th=[31065], 40.00th=[31065], 50.00th=[31065], 60.00th=[31065],
     | 70.00th=[31065], 80.00th=[31065], 90.00th=[31065], 95.00th=[31065],
     | 99.00th=[39060], 99.50th=[49021], 99.90th=[62129], 99.95th=[62653],
     | 99.99th=[69731]
   bw (  KiB/s): min=478926, max=579584, per=100.00%, avg=527484.63, stdev=1058.84, samples=946
   iops        : min=  463, max=  566, avg=514.42, stdev= 1.06, samples=946
  lat (msec)   : 4=0.01%, 10=0.15%, 20=0.59%, 50=98.78%, 100=0.48%
  cpu          : usr=0.20%, sys=0.36%, ctx=15547, majf=0, minf=580
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15447,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=514MiB/s (539MB/s), 514MiB/s-514MiB/s (539MB/s-539MB/s), io=15.1GiB (16.2GB), run=30034-30034msec

Disk stats (read/write):
  sdc: ios=0/16625, sectors=0/33763272, merge=0/98, ticks=0/512719, in_queue=513032, util=89.51%