results/fio/scmp/run2.log
write_throughput: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=64
...
fio-3.39-38-gf18c
Starting 16 processes
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
[...]

write_throughput: (groupid=0, jobs=16): err= 0: pid=2849630: Sun Apr 27 22:22:54 2025
  write: IOPS=513, BW=514MiB/s (539MB/s)(15.1GiB/30026msec); 0 zone resets
    clat (usec): min=2212, max=73899, avg=31089.29, stdev=2568.79
     lat (usec): min=2261, max=73954, avg=31132.86, stdev=2568.75
    clat percentiles (usec):
     |  1.00th=[25297],  5.00th=[31065], 10.00th=[31065], 20.00th=[31065],
     | 30.00th=[31065], 40.00th=[31065], 50.00th=[31065], 60.00th=[31065],
     | 70.00th=[31065], 80.00th=[31065], 90.00th=[31065], 95.00th=[31327],
     | 99.00th=[39060], 99.50th=[45876], 99.90th=[60556], 99.95th=[64226],
     | 99.99th=[69731]
   bw (  KiB/s): min=473022, max=571461, per=100.00%, avg=526710.61, stdev=1021.06, samples=945
   iops        : min=  461, max=  558, avg=513.31, stdev= 1.01, samples=945
  lat (msec)   : 4=0.01%, 10=0.19%, 20=0.45%, 50=98.98%, 100=0.38%
  cpu          : usr=0.21%, sys=0.39%, ctx=15550, majf=0, minf=581
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15422,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=514MiB/s (539MB/s), 514MiB/s-514MiB/s (539MB/s-539MB/s), io=15.1GiB (16.2GB), run=30026-30026msec

Disk stats (read/write):
  sdc: ios=0/16590, sectors=0/33713840, merge=0/77, ticks=0/512842, in_queue=513071, util=92.30%