results/fio/scmp/run3.log
write_throughput: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=64
...
fio-3.39-38-gf18c
Starting 16 processes
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1
[...]

write_throughput: (groupid=0, jobs=16): err= 0: pid=2846485: Sun Apr 27 22:21:42 2025
  write: IOPS=509, BW=510MiB/s (535MB/s)(15.0GiB/30031msec); 0 zone resets
    clat (usec): min=2253, max=70598, avg=31319.68, stdev=2660.80
     lat (usec): min=2295, max=70639, avg=31364.29, stdev=2660.50
    clat percentiles (usec):
     |  1.00th=[25560],  5.00th=[30802], 10.00th=[31065], 20.00th=[31065],
     | 30.00th=[31065], 40.00th=[31065], 50.00th=[31065], 60.00th=[31327],
     | 70.00th=[31327], 80.00th=[31589], 90.00th=[31851], 95.00th=[32113],
     | 99.00th=[39060], 99.50th=[49546], 99.90th=[62653], 99.95th=[64226],
     | 99.99th=[67634]
   bw (  KiB/s): min=466944, max=563200, per=100.00%, avg=522892.36, stdev=1026.61, samples=946
   iops        : min=  456, max=  550, avg=510.07, stdev= 1.02, samples=946
  lat (msec)   : 4=0.01%, 10=0.08%, 20=0.35%, 50=99.07%, 100=0.49%
  cpu          : usr=0.20%, sys=0.39%, ctx=15454, majf=0, minf=580
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15310,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=510MiB/s (535MB/s), 510MiB/s-510MiB/s (535MB/s-535MB/s), io=15.0GiB (16.1GB), run=30031-30031msec

Disk stats (read/write):
  sdc: ios=0/16480, sectors=0/33480448, merge=0/81, ticks=0/512797, in_queue=513015, util=91.85%